Revit 2026 API

# BalusterPlacementBalusterPerTreadFamilyId Property

---

The id of baluster per tread family.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId BalusterPerTreadFamilyId { get; set; }
```
```vb
Public Property BalusterPerTreadFamilyId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ BalusterPerTreadFamilyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member BalusterPerTreadFamilyId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The balusterPerTreadFamilyId doesn't refer to a valid baluster family. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The property defines a baluster family type which is used for creation of balusters on treads. The number of such balusters is set by "BalusterPerTreadNumber" property. It works only for stairs which have treads and have "UseBalusterPerTreadOnStairs" set.

#### Reference

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace